/*
設計一個程式讀入2個整數，計算出2個整數間有幾個質數。

檔名: 學號-hw05.c (例如：04051234-hw05.c)

程式必須符合下列要求：
1. 程式第一行必須加上含程式名稱,學號,姓名,及考試日期的註解
2. 程式之輸入及輸出結果必須符合範例執行結果

=== 範例執行結果(1) ===
3 5 <-- 從鍵盤輸入3 5[Enter]
2

=== 範例執行結果(2) ===
11 2<-- 從鍵盤輸入11 2[Enter]
5

=== 範例執行結果(3) ===
100 200 <-- 從鍵盤輸入100 200[Enter]
21
*/
#include <stdio.h>
int main(void)
{
	int a,b,i,j,ans=0,ok;
	
	scanf("%d%d",&a,&b);
	
	if(a>=b)
	{
	    ok = a;
	    a = b;
	    b = ok;
	}
	for(i=a;i<=b;i++)
	{
		ok = 1;
	    for(j=2;j<i;j++)//判斷 i 
	    {
	    	if(i%j==0)
	    	    ok = 0;//i不是 
		}
		if(ok)
		    ans++;
	    
	}
	printf("%d",ans);
	
	return 0;
 } 
