/*
程式名稱:PS070142.c (請以程式名稱上傳)

從鍵盤讀入2個整數分別代表某個月份的天數及首日為星期幾。 
(每週的第一天為週日；週日以0表示，週一至週六以1-6表示) 
請在畫面上印出該月的月曆。 

=== 執行結果(1) === 
30 1 <-- 從鍵盤輸入30 1[Enter] 
    1  2  3  4  5  6 
 7  8  9 10 11 12 13 
14 15 16 17 18 19 20 
21 22 23 24 25 26 27 
28 29 30 

=== 執行結果(2) === 
28  6 <-- 從鍵盤輸入28 6[Enter] 
                   1 
 2  3  4  5  6  7  8 
 9 10 11 12 13 14 15 
16 17 18 19 20 21 22 
23 24 25 26 27 28 
*/
#include <stdio.h>
int main(void)
{
    int a,b,i,j;
    char space = ' ';

    scanf("%d%d",&a,&b);

    for(i=1;i<=b;i++)
    {
    printf("%c%c%c",space,space,space);
    
	i = i ;
	
    }
    for(j=1;j<=a;j++)
{
    if((b+j)%7==0)
	{
		printf("%2d\n",j);
	} 
	else
	{
		printf("%2d ",j);
	}
}

    return 0;
}